zephyrproject-rtos/zephyr/drivers/i2s/i2s_stm32_sai.c
/*
 * Copyright (c) 2024-2025 ZAL Zentrum für Angewandte Luftfahrtforschung GmbH
 * Copyright (c) 2024-2026 Mario Paja
 *
 * SPDX-License-Identifier: Apache-2.0
 */

#define DT_DRV_COMPAT st_stm32_sai

#include <string.h>
#include <zephyr/drivers/dma.h>
#include <zephyr/drivers/i2s.h>
#include <zephyr/drivers/dma/dma_stm32.h>
#include <soc.h>
#include <zephyr/drivers/clock_control/stm32_clock_control.h>
#include <zephyr/drivers/clock_control.h>
#include <zephyr/drivers/pinctrl.h>
#include <zephyr/cache.h>

#include <stm32_ll_dma.h>
#include <stm32_bitops.h>

#include <zephyr/logging/log.h>
#include <zephyr/irq.h>
LOG_MODULE_REGISTER(i2s_stm32_sai, CONFIG_I2S_LOG_LEVEL);

enum mclk_divider {
	MCLK_NO_DIV,
	MCLK_DIV_256,
	MCLK_DIV_512
};

static const uint32_t sai_fifo_threshold[] = {
	SAI_FIFOTHRESHOLD_EMPTY,
	SAI_FIFOTHRESHOLD_1QF,
	SAI_FIFOTHRESHOLD_HF,
	SAI_FIFOTHRESHOLD_3QF,
	SAI_FIFOTHRESHOLD_FULL,
};

struct queue_item {
	void *buffer;
	size_t size;
};

struct stream {
	DMA_TypeDef *reg;

	const struct device *dma_dev;
	uint32_t dma_channel;
	struct dma_config dma_cfg;

	/* DMA size of a source block transfer in bytes according SAI data size. */
	uint8_t dma_src_size;

	struct i2s_config i2s_cfg;
	void *mem_block;
	size_t mem_block_len;

	bool master;
	bool last_block;

	int32_t state;
	struct k_msgq queue;

	int (*stream_start)(const struct device *dev, enum i2s_dir dir);
	void (*queue_drop)(const struct device *dev);
};

struct stm32_sai_sub_data {
	SAI_HandleTypeDef hsai;
	DMA_HandleTypeDef hdma;
	struct stream stream;
};

struct stm32_sai_sub_cfg {
	const struct pinctrl_dev_config *pincfg;
	bool mclk_enable;
	enum mclk_divider mclk_div;
	bool synchronous;
	enum i2s_dir dir;
	bool is_sai_b;

	const struct device *controller;
};

struct stm32_sai_cfg {
	const struct stm32_pclken sai_ck;
	const struct stm32_pclken sai_ker_ck;
	const struct stm32_pclken sai_b_ker_ck; /* Dedicated to SAIn_B, if applicable */
	bool has_sai_ker_ck: 1;
	bool has_sai_b_ker_ck: 1;
};

static inline void sai_sub_disable(SAI_HandleTypeDef *hsai, i2s_opt_t options)
{
	if ((options & I2S_OPT_BIT_CLK_GATED) == 0) {
		LOG_DBG("SAI sub-block %p not disabled: bit clock gating disabled", hsai->Instance);
		return;
	}

	if (hsai->Init.Synchro == SAI_SYNCHRONOUS) {
		LOG_DBG("SAI sub-block %p not disabled: configured as synchronous peripheral",
			hsai->Instance);
		return;
	}

	__HAL_SAI_DISABLE(hsai);

	LOG_DBG("SAI Disabled");
}

void HAL_SAI_RxCpltCallback(SAI_HandleTypeDef *hsai)
{
	struct stm32_sai_sub_data *sub_data = CONTAINER_OF(hsai, struct stm32_sai_sub_data, hsai);
	struct stream *stream = &sub_data->stream;
	int ret;

	/* Exit the callback, Stream is stopped */
	if (stream->state == I2S_STATE_ERROR) {
		goto exit;
	}

	if (stream->mem_block == NULL) {
		if (stream->state != I2S_STATE_READY) {
			stream->state = I2S_STATE_ERROR;
			LOG_ERR("RX mem_block NULL");
			sai_sub_disable(hsai, stream->i2s_cfg.options);
			goto exit;
		} else {
			return;
		}
	}

	struct queue_item item = {.buffer = stream->mem_block, .size = stream->mem_block_len};

	ret = k_msgq_put(&stream->queue, &item, K_NO_WAIT);
	if (ret < 0) {
		stream->state = I2S_STATE_ERROR;
		sai_sub_disable(hsai, stream->i2s_cfg.options);
		goto exit;
	}

	if (stream->state == I2S_STATE_STOPPING) {
		stream->state = I2S_STATE_READY;
		LOG_DBG("Stopping RX ...");
		sai_sub_disable(hsai, stream->i2s_cfg.options);
		goto exit;
	}

	ret = k_mem_slab_alloc(stream->i2s_cfg.mem_slab, &stream->mem_block, K_NO_WAIT);
	if (ret < 0) {
		stream->state = I2S_STATE_ERROR;
		sai_sub_disable(hsai, stream->i2s_cfg.options);
		goto exit;
	}

	stream->mem_block_len = stream->i2s_cfg.block_size;

	if (HAL_SAI_Receive_DMA(hsai, stream->mem_block,
				stream->mem_block_len / stream->dma_src_size) != HAL_OK) {
		LOG_ERR("HAL_SAI_Receive_DMA: <FAILED>");
	}

exit:
	/* EXIT */
}

void HAL_SAI_TxCpltCallback(SAI_HandleTypeDef *hsai)
{
	struct stm32_sai_sub_data *sub_data = CONTAINER_OF(hsai, struct stm32_sai_sub_data, hsai);
	struct stream *stream = &sub_data->stream;
	void *mem_block_tmp = stream->mem_block;
	struct queue_item item;
	int ret;

	if (stream->state == I2S_STATE_ERROR) {
		LOG_ERR("TX bad status: %d, Stopping...", stream->state);
		sai_sub_disable(hsai, stream->i2s_cfg.options);
		goto exit;
	}

	if (stream->mem_block == NULL) {
		if (stream->state != I2S_STATE_READY) {
			stream->state = I2S_STATE_ERROR;
			LOG_ERR("TX mem_block NULL");
			sai_sub_disable(hsai, stream->i2s_cfg.options);
			goto exit;
		} else {
			return;
		}
	}

	if (stream->last_block) {
		LOG_DBG("TX Stopped ...");
		stream->state = I2S_STATE_READY;
		stream->mem_block = NULL;
		sai_sub_disable(hsai, stream->i2s_cfg.options);
		goto exit;
	}

	/* Exit callback, no more data in the queue */
	/* Reset I2S state */
	if (k_msgq_num_used_get(&stream->queue) == 0) {
		LOG_DBG("Exit TX callback, no more data in the queue");
		stream->state = I2S_STATE_READY;
		stream->mem_block = NULL;
		sai_sub_disable(hsai, stream->i2s_cfg.options);
		goto exit;
	}

	ret = k_msgq_get(&stream->queue, &item, K_NO_WAIT);
	if (ret < 0) {
		stream->state = I2S_STATE_ERROR;
		sai_sub_disable(hsai, stream->i2s_cfg.options);
		goto exit;
	}

	stream->mem_block = item.buffer;
	stream->mem_block_len = item.size;

	sys_cache_data_flush_range(stream->mem_block, stream->mem_block_len);

	if (HAL_SAI_Transmit_DMA(hsai, stream->mem_block,
				 stream->mem_block_len / stream->dma_src_size) != HAL_OK) {
		LOG_ERR("HAL_SAI_Transmit_DMA: <FAILED>");
	}

exit:
	/* Free memory slab & exit */
	k_mem_slab_free(stream->i2s_cfg.mem_slab, mem_block_tmp);
}

void HAL_SAI_ErrorCallback(SAI_HandleTypeDef *hsai)
{
	switch (HAL_SAI_GetError(hsai)) {
	case HAL_SAI_ERROR_NONE:
		LOG_INF("No error");
		break;
	case HAL_SAI_ERROR_OVR:
		LOG_WRN("Overrun Error");
		break;
	case HAL_SAI_ERROR_UDR:
		LOG_WRN("Underrun Error");
		break;
	case HAL_SAI_ERROR_AFSDET:
		LOG_WRN("Anticipated Frame synchronisation detection");
		break;
	case HAL_SAI_ERROR_LFSDET:
		LOG_WRN("Late Frame synchronisation detection");
		break;
	case HAL_SAI_ERROR_CNREADY:
		LOG_WRN("codec not ready");
		break;
	case HAL_SAI_ERROR_TIMEOUT:
		LOG_WRN("Timeout error");
		break;
	case HAL_SAI_ERROR_DMA:
		LOG_WRN("DMA error");
		break;
	default:
		LOG_ERR("Unknown error");
	}
}

static int stm32_sai_clock_en(const struct device *dev)
{
	const struct stm32_sai_cfg *sai_cfg = dev->config;
	const struct device *clk = DEVICE_DT_GET(STM32_CLOCK_CONTROL_NODE);
	int ret;

	/* Turn on SAI peripheral clock */
	ret = clock_control_on(clk, (clock_control_subsys_t)&sai_cfg->sai_ck);
	if (ret != 0) {
		return -EIO;
	}

	/* Configure shared SAIn_A & SAIn_B or dedicated SAIn_A kernel clock */
	if (sai_cfg->has_sai_ker_ck) {
		ret = clock_control_configure(clk, (clock_control_subsys_t)&sai_cfg->sai_ker_ck,
					      NULL);
		if (ret != 0) {
			return -EIO;
		}
	}

	/* Configure dedicated SAI B kernel clock */
	if (sai_cfg->has_sai_b_ker_ck) {
		ret = clock_control_configure(clk, (clock_control_subsys_t)&sai_cfg->sai_b_ker_ck,
					      NULL);
		if (ret != 0) {
			return -EIO;
		}
	}

