zephyrproject-rtos/zephyr/drivers/i2s/i2s_stm32_sai.c
	return 0;
}

static int sai_sub_dma_init(const struct device *dev)
{
	struct stm32_sai_sub_data *sub_data = dev->data;
	struct stream *stream = &sub_data->stream;
	struct dma_config *dma_cfg = &sub_data->stream.dma_cfg;
	uint16_t source_addr_adj, dest_addr_adj;
	int ret;

	SAI_HandleTypeDef *hsai = &sub_data->hsai;
	DMA_HandleTypeDef *hdma = &sub_data->hdma;

	if (!device_is_ready(stream->dma_dev)) {
		LOG_ERR("%s DMA device not ready", stream->dma_dev->name);
		return -ENODEV;
	}

	/* Proceed to the minimum Zephyr DMA driver init */
	dma_cfg->user_data = hdma;
	if (dma_cfg->channel_direction == (enum dma_channel_direction)MEMORY_TO_PERIPHERAL) {
		source_addr_adj = DMA_ADDR_ADJ_INCREMENT;
		dest_addr_adj = DMA_ADDR_ADJ_NO_CHANGE;
	} else {
		source_addr_adj = DMA_ADDR_ADJ_NO_CHANGE;
		dest_addr_adj = DMA_ADDR_ADJ_INCREMENT;
	}

	/* HACK: This field is used to inform driver that it is overridden */
	dma_cfg->linked_channel = STM32_DMA_HAL_OVERRIDE;

	ret = dma_config(stream->dma_dev, stream->dma_channel, dma_cfg);
	if (ret != 0) {
		LOG_ERR("Failed to configure DMA channel %d", stream->dma_channel);
		return ret;
	}

	ret = dma_stm32_zcfg_to_halcfg(stream->dma_dev, dma_cfg, &hdma->Init,
				       source_addr_adj, dest_addr_adj);
	if (ret < 0) {
		return ret;
	}

#if defined(CONFIG_DMA_STM32U5)
	hdma->Init.SrcBurstLength = 1;
	hdma->Init.DestBurstLength = 1;
	hdma->Init.TransferAllocatedPort = DMA_SRC_ALLOCATED_PORT0 | DMA_DEST_ALLOCATED_PORT0;
#endif

	hdma->Instance = STM32_DMA_GET_INSTANCE(stream->reg, stream->dma_channel);

	if (dma_cfg->channel_direction == (enum dma_channel_direction)MEMORY_TO_PERIPHERAL) {
		__HAL_LINKDMA(hsai, hdmatx, sub_data->hdma);
	} else {
		__HAL_LINKDMA(hsai, hdmarx, sub_data->hdma);
	}

	if (HAL_DMA_Init(&sub_data->hdma) != HAL_OK) {
		LOG_ERR("HAL_DMA_Init: <FAILED>");
		return -EIO;
	}

#if defined(CONFIG_SOC_SERIES_STM32N6X)
	if (HAL_DMA_ConfigChannelAttributes(&sub_data->hdma, DMA_CHANNEL_SEC | DMA_CHANNEL_PRIV |
					    DMA_CHANNEL_SRC_SEC | DMA_CHANNEL_DEST_SEC) != HAL_OK) {
		LOG_ERR("HAL_DMA_ConfigChannelAttributes: <Failed>");
		return -EIO;
	}
#elif defined(CONFIG_DMA_STM32U5)
	if (HAL_DMA_ConfigChannelAttributes(&sub_data->hdma, DMA_CHANNEL_NPRIV) != HAL_OK) {
		LOG_ERR("HAL_DMA_ConfigChannelAttributes: <Failed>");
		return -EIO;
	}
#endif

	LOG_DBG("dma@%08x Init: <OK>", (uint32_t)hdma->Instance);

	return 0;
}

static int sai_sub_init(const struct device *dev)
{
	struct stm32_sai_sub_data *sub_data = dev->data;
	const struct stm32_sai_sub_cfg *sub_cfg = dev->config;
	struct stream *stream = &sub_data->stream;
	int ret = 0;

	/* Configure DT provided pins */
	ret = pinctrl_apply_state(sub_cfg->pincfg, PINCTRL_STATE_DEFAULT);
	if (ret < 0) {
		LOG_ERR("SAI Sub-Block pinctrl setup: <FAILED>, ret: %d", ret);
		return ret;
	}

	if (!device_is_ready(sub_data->stream.dma_dev)) {
		LOG_ERR("%s device not ready", sub_data->stream.dma_dev->name);
		return -ENODEV;
	}

	ret = k_msgq_alloc_init(&sub_data->stream.queue, sizeof(struct queue_item),
				CONFIG_I2S_STM32_SAI_BLOCK_COUNT);
	if (ret < 0) {
		LOG_ERR("k_msgq_alloc_init(): <FAILED>, ret: %d", ret);
		return ret;
	}

	/* Initialize DMA */
	ret = sai_sub_dma_init(dev);
	if (ret < 0) {
		LOG_ERR("SAI Sub-Block DMA Init <FAILED>, ret: %d", ret);
		return ret;
	}

	/* State set to not ready until successfully configured */
	stream->state = I2S_STATE_NOT_READY;

	return 0;
}

static void dma_callback(const struct device *dma_dev, void *arg, uint32_t channel, int status)
{
	DMA_HandleTypeDef *hdma = arg;

	ARG_UNUSED(dma_dev);

	if (status < 0) {
		LOG_ERR("DMA callback error with channel %d.", channel);
	}
	HAL_DMA_IRQHandler(hdma);
}

#if defined(CONFIG_SOC_SERIES_STM32F4X)
static int stm32_sai_sub_f4_clk_src_conf(const struct device *dev)
{
	const struct stm32_sai_sub_cfg *sub_cfg = dev->config;
	const struct stm32_sai_cfg *sai_cfg = sub_cfg->controller->config;
	struct stm32_sai_sub_data *sub_data = dev->data;
	SAI_HandleTypeDef *hsai = &sub_data->hsai;
	uint32_t clock_source = 0U;

	if (sai_cfg->has_sai_ker_ck) {
		clock_source = sai_cfg->sai_ker_ck.bus;
	}

	switch (clock_source) {
#if defined(STM32F413xx) || defined(STM32F423xx)
	case STM32_SRC_PLLI2S_POST_R:
		hsai->Init.ClockSource = SAI_CLKSOURCE_PLLI2S;
		break;

	case STM32_SRC_PLL_POST_R:
		hsai->Init.ClockSource = SAI_CLKSOURCE_PLLR;
		break;

	case STM32_SRC_HSI:
		hsai->Init.ClockSource = SAI_CLKSOURCE_HS;
		break;
#else /* STM32F413xx || STM32F423xx */
	case STM32_SRC_PLLSAI_POST_Q:
		hsai->Init.ClockSource = SAI_CLKSOURCE_PLLSAI;
		break;

	case STM32_SRC_PLLI2S_POST_Q:
		hsai->Init.ClockSource = SAI_CLKSOURCE_PLLI2S;
		break;
#endif /* STM32F413xx || STM32F423xx */
	case 0U:
		/* No source clock defined. Do nothing. */
		break;

	default:
		LOG_ERR("Wrong source clock defined.");
		return -EINVAL;
	}

	return 0;
}
#endif /* CONFIG_SOC_SERIES_STM32F4X */

static int stm32_sai_sub_conf(const struct device *dev, enum i2s_dir dir,
				   const struct i2s_config *i2s_cfg)
{
	const struct stm32_sai_sub_cfg *const sub_cfg = dev->config;
	struct stm32_sai_sub_data *const sub_data = dev->data;
	struct stream *stream = &sub_data->stream;
	SAI_HandleTypeDef *hsai = &sub_data->hsai;
	uint8_t protocol;
	uint8_t word_size;

	memcpy(&stream->i2s_cfg, i2s_cfg, sizeof(struct i2s_config));

	stream->master = true;
	if (i2s_cfg->options & I2S_OPT_FRAME_CLK_TARGET ||
	    i2s_cfg->options & I2S_OPT_BIT_CLK_TARGET) {
		stream->master = false;
	}

#if defined(CONFIG_SOC_SERIES_STM32F4X)
	int err;

	/* ON F4x, the HAL modifies the RCC to set the source clock, so it is necessary to define
	 * the ClockSource Init parameter.
	 */
	err = stm32_sai_sub_f4_clk_src_conf(dev);
	if (err != 0) {
		return err;
	}
#endif /* CONFIG_SOC_SERIES_STM32F4X */

	hsai->Init.Synchro = SAI_ASYNCHRONOUS;

	if (dir == I2S_DIR_RX) {
		if (sub_cfg->dir == I2S_DIR_TX) {
			LOG_ERR("Invalid direction, SAI configured as TX");
			return -EINVAL;
		}

		hsai->Init.AudioMode = SAI_MODEMASTER_RX;

		if (stream->master == false) {
			hsai->Init.AudioMode = SAI_MODESLAVE_RX;
			if (sub_cfg->synchronous) {
				hsai->Init.Synchro = SAI_SYNCHRONOUS;
				LOG_WRN("Synchronous RX peripheral mode requires an active "
					"controller with bit clock gating disabled");
			}
		}

	} else if (dir == I2S_DIR_TX) {
		if (sub_cfg->dir == I2S_DIR_RX) {
			LOG_ERR("Invalid direction, SAI configured as RX");
			return -EINVAL;
		}

		hsai->Init.AudioMode = SAI_MODEMASTER_TX;

		if (stream->master == false) {
			hsai->Init.AudioMode = SAI_MODESLAVE_TX;
			if (sub_cfg->synchronous) {
				hsai->Init.Synchro = SAI_SYNCHRONOUS;
				LOG_WRN("Synchronous TX peripheral mode requires an active "
					"controller with bit clock gating disabled");
			}
		}
	} else {
		LOG_ERR("Either RX or TX direction must be selected");
		return -EINVAL;
	}

	if (stream->state != I2S_STATE_NOT_READY && stream->state != I2S_STATE_READY) {
		LOG_ERR("Invalid state: %d", (int)stream->state);
		return -EINVAL;
	}

	/* MckOutput is not supported by all MCU series */
#if defined(SAI_MCK_OUTPUT_ENABLE)
	if (sub_cfg->mclk_enable && stream->master) {
		hsai->Init.MckOutput = SAI_MCK_OUTPUT_ENABLE;
	} else {
		hsai->Init.MckOutput = SAI_MCK_OUTPUT_DISABLE;
	}
#endif

	if (sub_cfg->mclk_div == (enum mclk_divider)MCLK_NO_DIV) {
		hsai->Init.NoDivider = SAI_MASTERDIVIDER_DISABLE;
	} else {
		hsai->Init.NoDivider = SAI_MASTERDIVIDER_ENABLE;

