zephyrproject-rtos/zephyr/drivers/i2s/i2s_stm32_sai.c
		ret = k_mem_slab_alloc(stream->i2s_cfg.mem_slab, &stream->mem_block, K_NO_WAIT);
		if (ret < 0) {
			return -ENOMEM;
		}

		stream->mem_block_len = stream->i2s_cfg.block_size;

		if (HAL_SAI_Receive_DMA(hsai, stream->mem_block,
					stream->mem_block_len / stream->dma_src_size) != HAL_OK) {
			LOG_ERR("HAL_SAI_Receive_DMA: <FAILED>");
			return -EIO;
		}
	}

	return 0;
}

static void queue_drop(const struct device *dev)
{
	struct stm32_sai_sub_data *sub_data = dev->data;
	struct stream *stream = &sub_data->stream;
	struct queue_item item;

	if (stream->mem_block != NULL) {
		stream->mem_block = NULL;
		stream->mem_block_len = 0;
	}

	while (k_msgq_get(&stream->queue, &item, K_NO_WAIT) == 0) {
		LOG_DBG("Dropping item from queue");
		k_mem_slab_free(stream->i2s_cfg.mem_slab, item.buffer);
	}
}

static int stm32_sai_sub_trigger(const struct device *dev, enum i2s_dir dir,
				 enum i2s_trigger_cmd cmd)
{
	struct stm32_sai_sub_data *sub_data = dev->data;
	struct stream *stream = &sub_data->stream;
	unsigned int key;
	int ret;

	if (dir == I2S_DIR_BOTH) {
		LOG_ERR("Unsupported direction: %d", (int)dir);
		return -ENOTSUP;
	}

	switch (cmd) {
	case I2S_TRIGGER_START:
		LOG_DBG("I2S_TRIGGER_START");

		if (stream->state != I2S_STATE_READY) {
			LOG_ERR("START trigger: invalid state %d", stream->state);
			return -EIO;
		}

		ret = stream->stream_start(dev, dir);
		if (ret < 0) {
			LOG_ERR("START trigger failed %d", ret);
			return ret;
		}

		stream->state = I2S_STATE_RUNNING;
		stream->last_block = false;

		break;
	case I2S_TRIGGER_STOP:
		key = irq_lock();
		LOG_DBG("I2S_TRIGGER_STOP");

		if (stream->state != I2S_STATE_RUNNING) {
			LOG_ERR("STOP - Invalid state: %d", (int)stream->state);
			irq_unlock(key);
			return -EIO;
		}

		stream->last_block = true;
		stream->state = I2S_STATE_STOPPING;

		irq_unlock(key);
		break;
	case I2S_TRIGGER_DRAIN:
		key = irq_lock();
		LOG_DBG("I2S_TRIGGER_DRAIN");

		if (stream->state != I2S_STATE_RUNNING) {
			LOG_ERR("DRAIN - Invalid state: %d", (int)stream->state);
			irq_unlock(key);
			return -EIO;
		}

		stream->state = I2S_STATE_STOPPING;

		irq_unlock(key);
		break;
	case I2S_TRIGGER_DROP:
		key = irq_lock();
		LOG_DBG("I2S_TRIGGER_DROP");

		if (stream->state == I2S_STATE_NOT_READY) {
			LOG_ERR("DROP - invalid state: %d", (int)stream->state);
			irq_unlock(key);
			return -EIO;
		}

		stream->queue_drop(dev);
		stream->state = I2S_STATE_READY;

		irq_unlock(key);
		break;
	case I2S_TRIGGER_PREPARE:
		key = irq_lock();
		LOG_DBG("I2S_TRIGGER_PREPARE");

		if (stream->state != I2S_STATE_ERROR) {
			LOG_ERR("PREPARE - invalid state: %d", (int)stream->state);
			irq_unlock(key);
			return -EIO;
		}
		stream->queue_drop(dev);
		stream->state = I2S_STATE_READY;

		irq_unlock(key);
		break;
	default:
		LOG_ERR("Unsupported trigger command");
		return -EINVAL;
	}
	return 0;
}

static int sai_init(const struct device *dev)
{
	int ret = 0;

	/* Enable SAI clock */
	ret = stm32_sai_clock_en(dev);
	if (ret < 0) {
		LOG_ERR("SAI clock enable <FAILED>, ret: %d.", ret);
		return -EIO;
	}

	LOG_DBG("%s Init: <OK>", dev->name);

	return 0;
}

static const struct i2s_config *stm32_sai_sub_conf_get(const struct device *dev, enum i2s_dir dir)
{
	const struct stm32_sai_sub_cfg *const sub_cfg = dev->config;
	struct stm32_sai_sub_data *sub_data = dev->data;
	struct stream *stream = &sub_data->stream;

	if (sub_cfg->dir != dir) {
		LOG_WRN("Direction mismatch: requested %d, sub-block configured as %d", dir,
			sub_cfg->dir);
		return NULL;
	}

	if (stream != NULL && stream->state != I2S_STATE_NOT_READY) {
		return &stream->i2s_cfg;
	}

	return NULL;
}

static DEVICE_API(i2s, i2s_stm32_sai_api) = {
	.configure = stm32_sai_sub_conf,
	.trigger = stm32_sai_sub_trigger,
	.write = stm32_sai_sub_write,
	.read = stm32_sai_sub_read,
	.config_get = stm32_sai_sub_conf_get,
};

struct stm32_sai_sub_mclk_cfg {
	const struct device *sai_sub;
};

/* Does not actually enable MCLK:
 * MCKEN/MCKDIV are exclusively configured by stm32_sai_sub_conf().
 * This only reports whether MCLK is already configured and exists
 * because consumers may require .on() before calling .get_rate().
 *
 * SAI_xCR1_MCKEN does not exist on every STM32 series.
 * MCLK there is implied by the sub-block being a controller.
 */
static int stm32_sai_sub_mclk_on(const struct device *dev, clock_control_subsys_t sys)
{
	const struct stm32_sai_sub_mclk_cfg *cfg = dev->config;
	const struct stm32_sai_sub_data *sub_data = cfg->sai_sub->data;
	uint32_t cr1;

	ARG_UNUSED(sys);

	cr1 = stm32_reg_read(&sub_data->hsai.Instance->CR1);

#if defined(SAI_xCR1_MCKEN)
	if ((cr1 & SAI_xCR1_MCKEN) == 0U) {
		return -ENOTSUP;
	}
#else
	if ((cr1 & SAI_xCR1_MODE_1) != 0U) {
		return -ENOTSUP;
	}
#endif

	return 0;
}

static int stm32_sai_sub_mclk_get_rate(const struct device *dev, clock_control_subsys_t sys,
				       uint32_t *rate)
{
	const struct stm32_sai_sub_mclk_cfg *cfg = dev->config;
	const struct stm32_sai_sub_data *sub_data = cfg->sai_sub->data;
	const struct stm32_sai_sub_cfg *sub_cfg = cfg->sai_sub->config;
	const struct stm32_sai_cfg *sai_cfg = sub_cfg->controller->config;
	const struct stm32_pclken *ker_ck;
	uint32_t cr1, mckdiv, ker_ck_freq;

	ARG_UNUSED(sys);

	cr1 = stm32_reg_read(&sub_data->hsai.Instance->CR1);

#if defined(SAI_xCR1_MCKEN)
	if ((cr1 & SAI_xCR1_MCKEN) == 0U) {
		return -ENOTSUP;
	}
#else
	if ((cr1 & SAI_xCR1_MODE_1) != 0U) {
		return -ENOTSUP;
	}
#endif

	mckdiv = (cr1 & SAI_xCR1_MCKDIV_Msk) >> SAI_xCR1_MCKDIV_Pos;
	if (mckdiv == 0U) {
		return -EIO;
	}

	ker_ck = (sub_cfg->is_sai_b && sai_cfg->has_sai_b_ker_ck) ? &sai_cfg->sai_b_ker_ck
							      : &sai_cfg->sai_ker_ck;

	if (clock_control_get_rate(DEVICE_DT_GET(STM32_CLOCK_CONTROL_NODE),
				   (clock_control_subsys_t)ker_ck, &ker_ck_freq) != 0) {
		return -EIO;
	}

#if defined(CONFIG_SOC_SERIES_STM32F4X)
	/* MCLK_x = SAI_CK_x / (MCKDIV * 2) (RM0090) */
	*rate = ker_ck_freq / (mckdiv * 2U);
#else
	*rate = ker_ck_freq / mckdiv;
#endif /* CONFIG_SOC_SERIES_STM32F4X */

	LOG_DBG("%s: ker_ck_freq=%u mckdiv=%u mclk=%u", cfg->sai_sub->name, ker_ck_freq,
		mckdiv, *rate);

