zephyrproject-rtos/zephyr/drivers/i2s/i2s_stm32_sai.c
	return 0;
}

static DEVICE_API(clock_control, stm32_sai_sub_mclk_api) = {
	.on = stm32_sai_sub_mclk_on,
	.get_rate = stm32_sai_sub_mclk_get_rate,
};

#define SAI_FIFO_THRESHOLD(node) sai_fifo_threshold[DT_ENUM_IDX(node, fifo_threshold)]

#if DT_HAS_COMPAT_STATUS_OKAY(st_stm32_dma_v2bis)
#define DMA_SLOT_BY_IDX(id, idx, slot) 0
#else
#define DMA_SLOT_BY_IDX(id, idx, slot) DT_DMAS_CELL_BY_IDX(id, idx, slot)
#endif

#define DMA_CHANNEL_CONFIG_BY_IDX(id, idx) DT_DMAS_CELL_BY_IDX(id, idx, channel_config)

#define SAI_SUB_DMA_CHANNEL_INIT(node, src, dest)                                                  \
	.stream = {                                                                                \
		.dma_dev = DEVICE_DT_GET(DT_DMAS_CTLR(node)),                                      \
		.dma_channel = DT_DMAS_CELL_BY_IDX(node, 0, channel),                              \
		.reg = (DMA_TypeDef *)DT_REG_ADDR(DT_PHANDLE_BY_IDX(node, dmas, 0)),               \
		.dma_cfg = {                                                                       \
			.dma_slot = DMA_SLOT_BY_IDX(node, 0, slot),                                \
			.channel_direction = src##_TO_##dest,                                      \
			.dma_callback = dma_callback,                                              \
			.channel_priority = STM32_DMA_CONFIG_PRIORITY(                             \
				DMA_CHANNEL_CONFIG_BY_IDX(node, 0)),                               \
			.source_data_size = STM32_DMA_CONFIG_##src##_DATA_SIZE(                    \
				DMA_CHANNEL_CONFIG_BY_IDX(node, 0)),                               \
			.dest_data_size = STM32_DMA_CONFIG_##dest##_DATA_SIZE(                     \
				DMA_CHANNEL_CONFIG_BY_IDX(node, 0)),                               \
		},                                                                                 \
		.stream_start = stream_start,                                                      \
		.queue_drop = queue_drop,                                                          \
	}

/* Sub-block B always sits at offset 0x24 from its controller, block A at 0x04 -- fixed by the
 * SAI IP itself across every ST family.
 */
#define SAI_SUB_B(node)                                                                            \
	((DT_REG_ADDR(node) - DT_REG_ADDR(DT_PARENT(node))) == 0x24)

#define SAI_SUB_INIT(node)                                                                         \
	PINCTRL_DT_DEFINE(node);                                                                   \
                                                                                                   \
	static struct stm32_sai_sub_data sub_data_##node = {                                       \
		.hsai = {                                                                          \
			.Instance = (SAI_Block_TypeDef *)DT_REG_ADDR(node),                        \
			.Init.OutputDrive = SAI_OUTPUTDRIVE_DISABLE,                               \
			.Init.FIFOThreshold = SAI_FIFO_THRESHOLD(node),                            \
			.Init.SynchroExt = SAI_SYNCEXT_DISABLE,                                    \
			.Init.CompandingMode = SAI_NOCOMPANDING,                                   \
			.Init.TriState = SAI_OUTPUT_NOTRELEASED,                                   \
		},                                                                                 \
		COND_CODE_1(DT_DMAS_HAS_NAME(node, tx),                                            \
		    (SAI_SUB_DMA_CHANNEL_INIT(node, MEMORY, PERIPHERAL)),                          \
		    (SAI_SUB_DMA_CHANNEL_INIT(node, PERIPHERAL, MEMORY))),                         \
	};                                                                                         \
                                                                                                   \
	static const struct stm32_sai_sub_cfg sub_cfg_##node = {                                   \
		.pincfg = PINCTRL_DT_DEV_CONFIG_GET(node),                                         \
		.mclk_enable = DT_PROP(node, mclk_enable),                                         \
		.mclk_div = DT_ENUM_IDX(node, mclk_divider),                                       \
		.synchronous = DT_PROP(node, synchronous),                                         \
		.is_sai_b = SAI_SUB_B(node),                                                       \
		.controller = DEVICE_DT_GET(DT_PARENT(node)),                                      \
		.dir = COND_CODE_1(DT_DMAS_HAS_NAME(node, tx), (I2S_DIR_TX), (I2S_DIR_RX)),        \
	};                                                                                         \
	DEVICE_DT_DEFINE(node, &sai_sub_init, NULL, &sub_data_##node, &sub_cfg_##node,             \
			 POST_KERNEL, CONFIG_I2S_INIT_PRIORITY, &i2s_stm32_sai_api);               \
	K_MSGQ_DEFINE_STATIC_TYPE(queue_##node, struct queue_item,                                 \
				  CONFIG_I2S_STM32_SAI_BLOCK_COUNT);                        \
                                                                                                   \
	DT_FOREACH_CHILD(node, SAI_SUB_MCLK_INIT)

#define SAI_SUB_MCLK_INIT(node)                                                                    \
	IF_ENABLED(DT_PROP(DT_PARENT(node), mclk_enable), (SAI_SUB_MCLK_DEV_INIT(node)))

#define SAI_SUB_MCLK_DEV_INIT(node)                                                                \
	static const struct stm32_sai_sub_mclk_cfg mclk_cfg_##node = {                             \
		.sai_sub = DEVICE_DT_GET(DT_PARENT(node)),                                         \
	};                                                                                         \
	DEVICE_DT_DEFINE(node, NULL, NULL, NULL, &mclk_cfg_##node,                                 \
			 POST_KERNEL, CONFIG_I2S_INIT_PRIORITY, &stm32_sai_sub_mclk_api);

#define SAI_KER_CK_FIELD_INIT(inst, n)                                                             \
	COND_CODE_1(DT_INST_CLOCKS_HAS_NAME(inst, n),                                              \
		(.n = STM32_DT_INST_CLOCK_INFO_BY_NAME(inst, n), .has_##n = true,),                \
		(.has_##n = false,))

#define SAI_KER_CK_INIT(inst)                                                                      \
	SAI_KER_CK_FIELD_INIT(inst, sai_ker_ck)                                                    \
	SAI_KER_CK_FIELD_INIT(inst, sai_b_ker_ck)

/* Controller Node */
#define SAI_INIT(inst)                                                                             \
	static const struct stm32_sai_cfg sai_cfg_##inst = {                                       \
		.sai_ck = STM32_DT_INST_CLOCK_INFO_BY_NAME(inst, sai_ck),                          \
		SAI_KER_CK_INIT(inst)                                                              \
	};                                                                                         \
	DEVICE_DT_INST_DEFINE(inst, &sai_init, NULL, NULL, &sai_cfg_##inst, POST_KERNEL,           \
			      CONFIG_I2S_INIT_PRIORITY, NULL);                                     \
                                                                                                   \
	DT_INST_FOREACH_CHILD_STATUS_OKAY(inst, SAI_SUB_INIT)

DT_INST_FOREACH_STATUS_OKAY(SAI_INIT)
